greeting();

function greeting() {
  console.log('안녕하세요!');
}

/**
 * greeting()이라는 함수 선언은 아래 줄에 있는데, 어떻게 첫 번째 줄에서 식별자 greeting에 접근할 수 있었던 걸까요?
 *
 * 모든 식별자는 컴파일 타임 때 각자의 스코프에 등록됩니다. 그리고 모든 식별자는 자신이 속한 스코프가 생성될 때
 * 해당 스코프의 시작 부분에서 생성됩니다. 이렇게 선언은 스코프 아래에 있더라도 스코프 시작 부분에서 변수의 가시성이 확보되는 걸
 * 호이스팅이라고 합니다.
 *
 * 여기까지의 설명이면 스코프 시작 부분에서 식별자 greeting을 볼 수 있다는 것까진 이해할 수 있지만, 선언이 되기도 전에 왜 함수
 * greeting()을 호출할 수 있는지 알 수 없습니다.
 *
 * 이는 함수 선언문의 고유한 특성인 함수 호이스팅 때문입니다. 함수 선언문으로 함수를 선언하면 함수 이름에 해당하는 식별자가
 * 스코프 최상단에 등록되고 함수 참조로 그 값이 자동으로 초기화됩니다.
 */
